In [21]:
import pandas as pd

In [22]:
def convert_date_columns(df, date_columns, utc_bool=False):
    for col in date_columns:
        df[col] = pd.to_datetime(df[col], utc=utc_bool, errors='coerce', dayfirst=True)
        df[col] = df[col].dt.tz_localize('Europe/Paris')
    return df

In [23]:
eau_df = pd.read_csv('./CSVs/eau.csv', sep=';')
temp_df = pd.read_csv('./CSVs/temperature.csv', sep=';')

In [24]:
date_columns = ['horodate']
eau_converted = convert_date_columns(eau_df, date_columns)
temp_converted = convert_date_columns(temp_df, date_columns)
eau_converted

      identifiant                  horodate pluie_mm
0               1 2022-04-29 19:42:00+02:00      0,1
1               1 2022-04-29 19:36:00+02:00      0,1
2               1 2022-04-26 00:24:00+02:00      0,1
3               1 2022-04-26 00:12:00+02:00      0,1
4               1 2022-04-26 00:06:00+02:00      0,1
...           ...                       ...      ...
5861           37 2022-04-01 04:12:00+02:00      0,1
5862           37 2022-04-01 04:06:00+02:00      0,2
5863           37 2022-04-01 04:00:00+02:00      0,1
5864           37 2022-04-01 03:48:00+02:00      0,1
5865           37 2022-04-01 03:42:00+02:00      0,1

[5866 rows x 3 columns]

In [25]:
temp_converted

                 deveui                  horodate degre_celsius
0      70b3d580a0100605 2022-04-29 23:59:00+02:00         14,75
1      70b3d580a0100647 2022-04-29 23:58:00+02:00            14
2      70b3d580a0100648 2022-04-29 23:56:00+02:00        13,625
3      70b3d580a0100623 2022-04-29 23:52:00+02:00       13,5625
4      70b3d580a0100654 2022-04-29 23:51:00+02:00         15,25
...                 ...                       ...           ...
26613  70b3d580a0100742 2022-04-01 00:03:00+02:00        5,9375
26614  70b3d580a01005fa 2022-04-01 00:02:00+02:00        8,0625
26615  70b3d580a0100600 2022-04-01 00:01:00+02:00        8,0625
26616  70b3d580a0100600 2022-04-01 00:01:00+02:00        8,0625
26617  70b3d580a0100549 2022-04-01 00:00:00+02:00        8,0625

[26618 rows x 3 columns]

In [26]:
# Conversion to csv
eau_converted.to_csv('./CSVs/eau_converted.csv', sep=';', index=False)
temp_converted.to_csv('./CSVs/temperature_converted.csv', sep=';', index=False)